const productsData = {
  "消毒": {
    "再": {
      "base": 70000,
      "price": 1500,
      "areaThreshold": 40
    },
    "新予防": {
      "base": 100000,
      "price": 2300,
      "areaThreshold": 40
    },
    "ﾔ駆除": {
      "base": 140000,
      "price": 3300,
      "areaThreshold": 40
    },
    "ｲｴ駆除": {
      "base": 140000,
      "price": 3300,
      "areaThreshold": 40
    },
    "切予防": {
      "base": 88000,
      "price": 2000,
      "areaThreshold": 40
    },
    "増築予防": {
      "base": 0,
      "price": 2100,
      "areaThreshold": 40
    },
    "建前予防": {
      "base": 84000,
      "price": 2100,
      "areaThreshold": 40
    },
    "ベイト新": {
      "base": 300000,
      "price": 3600,
      "areaThreshold": 40
    },
    "ベイト継": {
      "base": 220000,
      "price": 2000,
      "areaThreshold": 40
    },
    "カビ": {  // 名前は任意に変更可能です
      "price": 2500,
      "discountConditions": [
          { "type": "category", "value": "消毒" }
      ],
      "discount2Conditions": [
          { "type": "category", "value": "基礎" },
          { "type": "contains", "values": ["DC2", "60"] }
      ],
      "discountPrice": 1000,
      "discount2Price": 1700
  }
  },
  "床下機器": {
    "SO260新": {
      "base": 176000,
      "price": 92000
    },
    "SO260買": {
      "base": 165000,
      "price": 83000
    },
    "SO2(DC2)新": {
      "base": 77000,
      "price": 92000
    },
    "SO2(DC2)買": {
      "base": 77000,
      "price": 83000
    },
    "SO2新": {
      "base": 0,
      "price": 92000
    },
    "SO2買": {
      "base": 0,
      "price": 88000
    },
    "拡散2新": {
      "base": 0,
      "price": 66000
    },
    "拡散2買": {
      "base": 0,
      "price": 66000
    },
    "DC2新": {
      "base": 0,
      "price": 77000
    },
    "DC2買": {
      "base": 0,
      "price": 77000
    },
    "MJ60新": {
      "base": 0,
      "price": 176000
    },
    "MJ60買": {
      "base": 0,
      "price": 165000
    }

  },
  "天井機器": {
    "天換260新": {
      "base": 176000,
      "price": 91500
    },
    "天換260買": {
      "base": 165000,
      "price": 83000
    },
    "天換(DC2)新": {
      "base": 77000,
      "price": 91500
    },
    "天換(DC2)買": {
      "base": 77000,
      "price": 83000
    },
    "天換新": {
      "base": 0,
      "price": 95000
    },
    "天拡2新": {
      "base": 0,
      "price": 88000
    },
    "天換買": {
      "base": 0,
      "price": 83000
    },
    "天拡2買": {
      "base": 0,
      "price": 83000
    },
    "DC2": {
      "base": 0,
      "price": 77000
    },
    "MJ60新": {
      "base": 0,
      "price": 176000
    },
    "MJ60買": {
      "base": 0,
      "price": 165000
    }
  },
  "断熱遮熱": {
    "床断熱": {
      "base": 440000,
      "price": 6000,
      "areaThreshold": 33
    },
    "遮熱": {
      "base": 440000,
      "price": 7000,
      "areaThreshold": 33
    },
    "天断熱": {
      "base": 310000,
      "price": 10000,
      "areaThreshold": 20
    },
    "床断熱追": {
      "base": 210000,
      "price": 6000,
      "areaThreshold": 33
    },
    "遮熱追": {
      "base": 220000,
      "price": 7000,
      "areaThreshold": 33
    },
    "天断熱追": {
      "price": 10000,
    },
    "処理33未満": {
      "base": 50000,
      "price": 0
    },
    "処理33以上": {
      "base": 65000,
      "price": 0
    }
  },
  "基礎関連": {  // 新規追加
    "増し打ち": {
        "base": 350000,
        "price": 100000,
        "areaThreshold": 1
    },
    "表面補修": {
        "base": 60000,
        "price": 20000,
        "areaThreshold": 1
    },
    "アンカー": {
        "base": 70000,
        "price": 50000,
        "areaThreshold": 1
    },
    "基礎化粧": {
        "base": 112000,
        "price": 12000,
        "areaThreshold": 1
    },
    "人通口開口": {
      "price": 50000,
    },
    "人通口拡張": {
      "price": 50000,
    }
  },
  "そのほか": {
    "カビ": {
        "price": 2500,
        "discountConditions": [
            { "type": "category", "value": "消毒" }
        ],
        "discount2Conditions": [
            { "type": "category", "value": "基礎" },
            { "type": "contains", "values": ["DC2", "60"] }
        ],
        "discountPrice": 1000,
        "discount2Price": 1700
    },

    "BM": {
        "price": 3300,
        "discountConditions": [ // 割引条件
            { "type": "category", "value": "消毒" },
            { "type": "category", "value": "基礎" },
            { "type": "item", "value": "SO2(DC2)新" },
            { "type": "item", "value": "SO260買" }, 
            { "type": "item", "value": "SO260新" }, 
            { "type": "item", "value": "SO2(DC2)買" } 
        ],
        "discountPrice": 2800
    },

    "家屋補強": {
      "base": 770000,
      "price": 5500,
      "areaThreshold": 100
    },
    "SS": {
      "price": 12000
    },
    "ドールマン": {
      "price": 350000
    },
    "排水管洗浄": {
      "base": 50000,
      "price": 6000,
      "areaThreshold": 5
    },
    "排水管洗浄オプション": {
      "price": 5000,
    },
    "換気扇撤去": {
      "base": 40000,
      "price": 5000,
      "areaThreshold": 8
    },
    "火災報知器": {
      "price": 8000,
    },
    "島特1": {
      "base": 30000,
      "price": 0
    },
    "離島1": {
      "base": 20000,
      "price": 0
    },
    "離島2": {
      "base": 20000,
      "price": 0
    },
    "離島3": {
      "base": 5000,
      "price": 0
    }
  },

  "害虫": {
    "ゴキブリ": {
      "base": 20000,
      "price": 500,
      "areaThreshold": 20
    },
    "ムカデ": {
      "base": 20000,
      "price": 500,
      "areaThreshold": 40
    },
    "アリ": {
      "base": 25000,
      "price": 500,
      "areaThreshold": 40
    },
    "クモ・ヤスデ": {
      "base": 20000,
      "price": 500,
      "areaThreshold": 40
    },
    "樹木害虫": {
      "base": 20000,
      "price": 10000,
      "areaThreshold": 1
    },
    "スズメバチ(屋外)": {
      "base": 40000,
      "price": 30000,
      "areaThreshold": 1
    },
    "スズメバチ(屋内)": {
      "base": 50000,
      "price": 35000,
      "areaThreshold": 1
    },
    "ｱｼﾅｶﾞﾊﾞﾁ・ﾐﾂﾊﾞﾁ(屋外)": {
      "base": 25000,
      "price": 20000,
      "areaThreshold": 1
    },
    "ｱｼﾅｶﾞﾊﾞﾁ・ﾐﾂﾊﾞﾁ(屋内)": {
      "base": 35000,
      "price": 25000,
      "areaThreshold": 1
    }

  },


  "旧商品": {
    "DC旧": {
      "base": 0,
      "price": 40000,
      "discountValue": 3000
    },
    "MJ38新": {
      "base": 0,
      "price": 130000
    },
    "MJ38単品買": {
      "base": 0,
      "price": 130000
    },
    "MJ38(ｾｯﾄ)買": {
      "base": 0,
      "price": 100000
    },
    "SO旧新" :{
      "base": 0,
      "price": 70000
    },
    "SO旧単品買": {
      "base": 0,
      "price": 58000
    },
    "SO旧(ｾｯﾄ)買": {
      "base": 0,
      "price": 56000
    },

    "天拡旧新": {
      "base": 0,
      "price": 70000
    },
    "天拡旧買": {
      "base": 0,
      "price": 60000
    }
  }
};

window.kisoProductsData = {
  "新規工事": {
    "外基礎": {
      "高さ別価格": {
        "30": {
          "基本価格": 510000,
          "長さ加算": 6000
        },
        "40": {
          "基本価格": 540000,
          "長さ加算": 7000
        },
        "50": {
          "基本価格": 570000,
          "長さ加算": 8000
        },
        "60": {
          "基本価格": 600000,
          "長さ加算": 9000
        },
        "70": {
          "基本価格": 630000,
          "長さ加算": 10000
        },
        "80": {
          "基本価格": 660000,
          "長さ加算": 11000
        }
      },
      "基本長さ": 20
    },
    "中基礎": {
      "高さ別価格": {
        "30": {
          "基本価格": 450000,
          "長さ加算": 6000
        },
        "40": {
          "基本価格": 470000,
          "長さ加算": 7000
        },
        "50": {
          "基本価格": 490000,
          "長さ加算": 8000
        },
        "60": {
          "基本価格": 500000,
          "長さ加算": 9000
        },
        "70": {
          "基本価格": 510000,
          "長さ加算": 10000
        },
        "80": {
          "基本価格": 520000,
          "長さ加算": 11000
        }
      },
      "基本長さ": 10
    }
  },
  "追加工事": {
    "外基礎": {
      "高さ別価格": {
        "30": {
          "基本価格": 240000,
          "長さ加算": 6000
        },
        "40": {
          "基本価格": 270000,
          "長さ加算": 7000
        },
        "50": {
          "基本価格": 300000,
          "長さ加算": 8000
        },
        "60": {
          "基本価格": 330000,
          "長さ加算": 9000
        },
        "70": {
          "基本価格": 360000,
          "長さ加算": 10000
        },
        "80": {
          "基本価格": 390000,
          "長さ加算": 11000
        }
      },
      "基本長さ": 20
    },
    "中基礎": {
      "高さ別価格": {
        "30": {
          "基本価格": 240000,
          "長さ加算": 6000
        },
        "40": {
          "基本価格": 260000,
          "長さ加算": 7000
        },
        "50": {
          "基本価格": 280000,
          "長さ加算": 8000
        },
        "60": {
          "基本価格": 290000,
          "長さ加算": 9000
        },
        "70": {
          "基本価格": 300000,
          "長さ加算": 10000
        },
        "80": {
          "基本価格": 310000,
          "長さ加算": 11000
        }
      },
      "基本長さ": 10
    }
  },
  "クラック": {
    "外クラ": {
        "高さ別価格": {
            "30": {
                "基本価格": 10000,
                "長さ加算": 10000  // 1mあたりの単価
            },
            "40": {
                "基本価格": 12000,
                "長さ加算": 12000
            },
            "50": {
                "基本価格": 14000,
                "長さ加算": 14000
            },
            "60": {
                "基本価格": 16000,
                "長さ加算": 16000
            },
            "70": {
                "基本価格": 18000,
                "長さ加算": 18000
            },
            "80": {
                "基本価格": 20000,  
                "長さ加算": 20000
            }
        },
        "基本長さ": 1  // 1mあたりの計算
    },
    "中片クラ": {
        "高さ別価格": {
            "30": {
                "基本価格": 15000,
                "長さ加算": 15000
            },
            "40": {
                "基本価格": 18000,
                "長さ加算": 18000
            },
            "50": {
                "基本価格": 21000,
                "長さ加算": 21000
            },
            "60": {
                "基本価格": 24000,
                "長さ加算": 24000
            },
            "70": {
                "基本価格": 27000,
                "長さ加算": 27000
            },
            "80": {
                "基本価格": 30000, 
                "長さ加算": 30000
            }
        },
        "基本長さ": 1
    },
    "中両クラ": {
        "高さ別価格": {
            "30": {
                "基本価格": 25000,
                "長さ加算": 25000
            },
            "40": {
                "基本価格": 31000,
                "長さ加算": 31000
            },
            "50": {
                "基本価格": 37000,
                "長さ加算": 37000
            },
            "60": {
                "基本価格": 43000,
                "長さ加算": 43000
            },
            "70": {
                "基本価格": 49000,
                "長さ加算": 49000
            },
            "80": {
                "基本価格": 55000,  // 70cmと同じ価格を設定
                "長さ加算": 55000
            }
        },
        "基本長さ": 1
    }
}
};

window.goodsData = productsData;
